"espk" = "Porta para altifalante Apple";
"ispk" = "Integrada";
"emic" = "Porta para microfone";
"imic" = "Integrada";
"hdpn" = "Porta para auscultadores";
"lini" = "Porta de entrada áudio";
"lino" = "Porta de saída áudio";
"spdi" = "Porta óptica de entrada digital";
"spdo" = "Porta óptica de saída digital";
"pci " = "Placa PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Periférico de rede";
"blue" = "Bluetooth";
"bluh" = "Auscultadores Bluetooth";
"blus" = "Auricular Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
